package mergroup;

/**
 * Interface RegexConstants v1.0
 * Created by Midnight_Filth^MER aka Ramanenka M.E. on 27.04.2015.
 */
public interface RegexConstants {
    //------------------------------------------------------------//
    //описание любого числа (целого или дробного, с плюсом или минусом)
    public final static String Didit="([+-]?\\d+\\.?\\d*)";
    //------------------------------------------------------------//

    //------------------------------------------------------------//
    //представление времени в формате [часы]:[минуты]
    public final static String Time="([01]?[0-9]|2[0-3]):[0-5][0-9]";
    //------------------------------------------------------------//

    //------------------------------------------------------------//
    //представление электронной почты в формате mymail@tut.by
    public final static String Email="(\\w+)@(\\w+\\.)(\\w+)(\\.\\w+)*";
    //------------------------------------------------------------//

    //------------------------------------------------------------//
    //Парсер реквестов
    //Считать с консоли URl ссылку.
    //Вывести на экран через пробел список всех параметров (Параметры идут после ? и разделяются &, например, lvl=15).
    //URL содержит минимум 1 параметр.
    //Если присутствует параметр obj, то передать его значение в нужный метод alert.
    //        alert(double value) - для чисел (дробные числа разделяются точкой)
    //alert(String value) - для строк
    //
    //Пример 1
    //Ввод:
    //http://javarush.ru/alpha/index.html?lvl=15&view&name=Amigo
    //Вывод:
    //lvl view name
    //
    //Пример 2
    //Ввод:
    //http://javarush.ru/alpha/index.html?obj=3.14&name=Amigo
    //Вывод:
    //obj name
    //double 3.14
    public final static String Request="(\\&+)|(\\?+)";
    //------------------------------------------------------------//
}
